{
  "competitors": [
    {
      "id": "google-analytics",
      "name": "Google Analytics",
      "updates": [
        {
          "title": "Conversion attribution analysis report (Beta)",
          "description": "The Conversion attribution analysis report is a new addition to the advertising workspace that provides customers with the ability to uncover the full value of their marketing channels across the entire customer journey.",
          "date": "2026-01-15",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Improved web conversion management and reporting capabilities for Google Ads customers (Beta)",
          "description": "More flexible web conversion management tools and new cross-channel reporting features are now available for marketers and advertisers.",
          "date": "2026-01-15",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Cross-channel budgeting (Beta)",
          "description": "The Google Analytics team is excited to announce the release of cross-channel budgeting. Use cross-channel budgeting to track performance and optimize paid channel investments.",
          "date": "2026-01-15",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Auto-configured key events for lead generation Business objective",
          "description": "Analytics now automatically configures qualified and converted leads events as key events when the Business objective for lead generation is selected in order to guide clients towards the recommended best-practices for lead gen measurement. Once conf",
          "date": "2025-06-12",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Cost data import: expanded data sources (beta)",
          "description": "Additional data sources are now supported for cost data import in open beta. With this enhancement, you are able to import cost data from multiple sources such as:",
          "date": "2025-06-24",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Annotations now have Analyst+ permissions",
          "description": "Users with Analyst and above Google Analytics permissions can now create, edit, and delete annotations.",
          "date": "2025-07-01",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Item data import improvements",
          "description": "Item data import now allows importing item-scoped custom dimensions into Google Analytics. This provides greater flexibility to import item data without the need for item IDs, particularly beneficial for users with extensive product catalogs. Learn m",
          "date": "2025-07-14",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Default reports and suggested audiences for lead generation customers",
          "description": "We’re launching new reports and suggested audiences dedicated to customers whose goal is to generate leads.",
          "date": "2025-07-21",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Import cost data from Reddit Ads",
          "description": "You can now import cost data from Reddit through a seamless integration with Google Analytics. This enables advertisers to automatically track Reddit cost data within Google Analytics. Learn more about importing cost data from Reddit Ads.",
          "date": "2025-07-21",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Improved conversion data completeness",
          "description": "We’ve improved conversion data quality to prevent under-reporting of conversions for Google Analytics customers whose properties have 2 or more linked Google Ads accounts, and who have opted to credit paid and organic channels for web conversions the",
          "date": "2025-08-06",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Improved ecommerce data availability and usability",
          "description": "We’ve improved ecommerce data (item-scoped dimensions and metrics) availability and usability.",
          "date": "2025-08-25",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Import cost data from Snap ads",
          "description": "You can now import cost data from Snap through a seamless integration with Google Analytics. This enables advertisers to automatically track Snap cost data within Google Analytics.",
          "date": "2025-09-17",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Google Analytics linking recommendation in Google Ads",
          "description": "Customers who link their Google Ads or Google Marketing Platform accounts to a Google Analytics property are correlated with a 23% increase in conversions and a 10% reduction in cost per conversion.",
          "date": "2025-09-24",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Import cost data from Pinterest Ads",
          "description": "You can now import cost data from Pinterest through a seamless integration with Google Analytics. This enables advertisers to automatically track Pinterest cost data within Google Analytics.",
          "date": "2025-09-26",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "New diagnostic in Google Analytics for User-ID implementation issues",
          "description": "We’ve launched a new diagnostic to alert users of problematic User-ID implementations. Properties impacted by errors in user-ID implementation will see various diagnostic alerts throughout Google Analytics. The diagnostics include guidance on how to ",
          "date": "2025-10-02",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Benchmarking support for unnormalized metrics",
          "description": "We've expanded the Benchmarking feature in Google Analytics to give you more ways to compare your performance against others in your industry.",
          "date": "2025-10-02",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Import cost data from Meta and TikTok ads",
          "description": "You can now import cost data from Meta and TikTok through seamless integrations with Google Analytics. This enables advertisers to automatically track Meta and TikTok cost data within Google Analytics.",
          "date": "2025-10-07",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "User-provided data new infra",
          "description": "New User-Provided Data (UPD) infrastructure has launched, allowing new UPD customers to implement UPD without feature degradations. This improves UPD for Conversion and Customer Match. Early adopters on the old infrastructure may still see some degra",
          "date": "2025-11-05",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "User-provided data attribution improvement",
          "description": "Google Analytics improved the user-provided data (UPD) feature for better data quality and behavioral attribution. UPD now focuses on activation and Ads Conversions, improving Enhanced Conversions and Customer Match Audiences, and ensuring more accur",
          "date": "2025-11-05",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Cost data import is now Campaign data import",
          "description": "Google Analytics is updating the name of the existing Cost data import feature to Campaign data import.",
          "date": "2025-11-19",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Display dynamic remarketing in Google Analytics",
          "description": "With display dynamic remarketing for web now available in Google Analytics, you can take Google Ads remarketing further by showing website visitors personalized ads that contain products and services viewed on your site.",
          "date": "2025-12-01",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "New suggested audience templates for customer lifecycle goals",
          "description": "Google Analytics has launched two new suggested audience templates to allow customers to quickly create audiences for:",
          "date": "2025-12-01",
          "url": "https://support.google.com/analytics/answer/9164320"
        },
        {
          "title": "Analytics Advisor",
          "description": "We are excited to announce the launch of Analytics Advisor. This is an agentic conversational AI assistant, powered by Gemini models, that Analytics customers can evoke in the Google Analytics user interface whenever they have questions or need assis",
          "date": "2025-12-12",
          "url": "https://support.google.com/analytics/answer/9164320"
        }
      ]
    },
    {
      "id": "adobe-cja",
      "name": "Adobe CJA",
      "updates": [
        {
          "title": "Header overrides",
          "description": "You can specify in header name and secret header value in Content Analytics. This header overrides configuration ensures that Content Analytics sends custom HTTP headers to bypass any bot detection or gate traffic technologies you have implemented.",
          "date": "2026-02-02",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Stitching in connections",
          "description": "The stitching process in Customer Journey Analytics is now more simple. Instead of duplicating a dataset and applying stitching on the duplicated dataset, stitching is now done on the ingestion of data into Customer Journey Analytics, which removes the requirement of duplicated datasets and schemas.",
          "date": "2026-01-30",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Combine data sources from multiple IMS orgs",
          "description": "You can now use the Analytics Source Connector to combine multiple data sources from multiple IMS orgs. This allows organzations to have a combined view of their customer data, even when that customer data is spread across multiple IMS orgs. Note: This configuration is available only by submitting a",
          "date": "2026-01-30",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Data storytelling: Generate slide presentations from Workspace reports",
          "description": "You can now automatically generate a slide presentation (in .pptx format) that is based on an Analysis Workspace report. Workspace detects key insights in your report and converts them into stakeholder-ready slides. This feature reduces the time and effort required to surface findings, build executi",
          "date": "2026-01-27",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Analyze audiences from Experience Platform Profile datasets in Customer Journey Analytics",
          "description": "You can now ingest audience membership data from Experience Platform Profile datasets into a Customer Journey Analytics connection. Audiences become available as new dimensions for use in Analysis Workspace. This is made possible through a new capability in Customer Journey Analytics to ingest XDM o",
          "date": "2026-01-26",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Analytics source connector: Search report suites in Experience Platform",
          "description": "If you do have a high number of report suites you can now search for the report suite you want to connect to within the Analytics Source Connector dataflow workflow.",
          "date": "2025-10-29",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Streaming media services: Support schedule data",
          "description": "You can now upload scheduled data of past live Streaming Media content to more easily and accurately track viewership. The following are examples of live content that are supported with schedule data upload: Uploading schedule data allows you to track viewership data for individual programs that ran",
          "date": "2025-10-28",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Support for data mirror",
          "description": "With support for model-based schemas and change data capture (CDC) functionality for specific source connectors in Experience Platform, Customer Journey Analytics will be able to support data mirror functionality of data warehouse solutions like Snowflake, Azure Databricks, and Google BigQuery. Cont",
          "date": "2025-09-23",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Real-time reporting",
          "description": "Real-time reporting in Customer Journey Analytics displays and updates data and visualizations within one or more panels in Analysis Workspace in real time.",
          "date": "2025-10-21",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        },
        {
          "title": "Filter criteria included in line visualizations and sparklines",
          "description": "Any search filter criteria that you apply to a freeform table filter is now always included in sparklines. In addition, you can include search filter criteria in any connected line visualization. You can configure line visualizations to include search filter criteria by selecting the sparkline in th",
          "date": "2025-10-14",
          "url": "https://experienceleague.adobe.com/en/docs/analytics-platform/using/releases/latest"
        }
      ]
    },
    {
      "id": "amplitude",
      "name": "Amplitude",
      "updates": [
        {
          "title": "Unexpected/unplanned event properties inheriting shared property metadata",
          "description": "Analytics: Unexpected/unplanned event properties inheriting shared property metadata",
          "date": "2025-08-14",
          "url": "https://amplitude.com/releases/unexpected-unplanned-event-properties-inheriting-shared-metadata"
        },
        {
          "title": "Experiment debugger in Chrome Extension",
          "description": "Experiment: Experiment debugger in Chrome Extension",
          "date": "2025-08-15",
          "url": "https://amplitude.com/releases/experiment-debugger-in-chrome-extension"
        },
        {
          "title": "Self-serve Integration Portal",
          "description": "Data: Self-serve Integration Portal",
          "date": "2025-08-15",
          "url": "https://amplitude.com/releases/65bbc325-0035-44e8-9fc6-dc2e3249f729"
        },
        {
          "title": "Web Experiment Enhancements in the Chrome Extension",
          "description": "Experiment: Web Experiment Enhancements in the Chrome Extension",
          "date": "2025-08-15",
          "url": "https://amplitude.com/releases/web-experiment-chrome-extension"
        },
        {
          "title": "Time-between and tag-based throttles",
          "description": "Guides and Surveys: Time-between and tag-based throttles",
          "date": "2025-08-19",
          "url": "https://amplitude.com/releases/time-between-and-tag-based-throttles"
        },
        {
          "title": "Session Replay Cursor + Click Indicator",
          "description": "Session Replay: Session Replay Cursor + Click Indicator",
          "date": "2025-08-21",
          "url": "https://amplitude.com/releases/session-replay-cursor-and-click-indicator"
        },
        {
          "title": "Desktop Apps for Guides & Surveys",
          "description": "Guides and Surveys: Desktop Apps for Guides & Surveys",
          "date": "2025-08-27",
          "url": "https://amplitude.com/releases/desktop-apps-for-guides-and-surveys"
        },
        {
          "title": "Element Selection Strategy",
          "description": "Guides and Surveys: Element Selection Strategy",
          "date": "2025-08-27",
          "url": "https://amplitude.com/releases/element-selection-strategy"
        },
        {
          "title": "Group Cohort Targeting for Guides and Surveys",
          "description": "Guides and Surveys: Group Cohort Targeting for Guides and Surveys",
          "date": "2025-09-03",
          "url": "https://amplitude.com/releases/group-cohorting-targeting-guides-and-surveys"
        },
        {
          "title": "Version History for Guides & Surveys",
          "description": "Guides and Surveys: Version History for Guides & Surveys",
          "date": "2025-09-03",
          "url": "https://amplitude.com/releases/version-history-for-guides-surveys"
        },
        {
          "title": "Testing Status for Guides & Surveys",
          "description": "Guides and Surveys: Testing Status for Guides & Surveys",
          "date": "2025-09-04",
          "url": "https://amplitude.com/releases/testing-status-for-guides-and-surveys"
        },
        {
          "title": "Content alignment for Guides and Surveys",
          "description": "Guides and Surveys: Content alignment for Guides and Surveys",
          "date": "2025-09-05",
          "url": "https://amplitude.com/releases/content-alignment-for-guides-and-surveys"
        },
        {
          "title": "Improved Themes Preview UX for Guides and Surveys",
          "description": "Guides and Surveys: Improved Themes Preview UX for Guides and Surveys",
          "date": "2025-09-19",
          "url": "https://amplitude.com/releases/improved-themes-preview-ux-for-guides-and-surveys"
        },
        {
          "title": "Redesigned Invite Modal",
          "description": "Activation: Redesigned Invite Modal",
          "date": "2025-09-22",
          "url": "https://amplitude.com/releases/redesigned-invite-modal"
        },
        {
          "title": "Flag and Experiment Approvals Workflow",
          "description": "Experiment: Flag and Experiment Approvals Workflow",
          "date": "2025-09-22",
          "url": "https://amplitude.com/releases/flag-and-experiment-approvals-workflow"
        },
        {
          "title": "Autocapture Masking & Data Protection",
          "description": "Data: Autocapture Masking & Data Protection",
          "date": "2025-09-26",
          "url": "https://amplitude.com/releases/autocapture-masking-data-protection"
        },
        {
          "title": "Chart Chat",
          "description": "AI: Chart Chat",
          "date": "2025-09-26",
          "url": "https://amplitude.com/releases/chart-chat"
        },
        {
          "title": "Journeys Sunburst Visualization — New Chart Type",
          "description": "Analytics: Journeys Sunburst Visualization — New Chart Type",
          "date": "2025-09-29",
          "url": "https://amplitude.com/releases/journeys-sunburst-visualization-new-chart-type"
        },
        {
          "title": "Streaming out Lookup Properties",
          "description": "Data: Streaming out Lookup Properties",
          "date": "2025-09-30",
          "url": "https://amplitude.com/releases/streaming-out-lookup-properties"
        },
        {
          "title": "Funnels Available from Microscope Menu",
          "description": "Analytics: Funnels Available from Microscope Menu",
          "date": "2025-10-08",
          "url": "https://amplitude.com/releases/1759951038.748179"
        },
        {
          "title": "Automated Insights",
          "description": "Analytics: Automated Insights",
          "date": "2025-10-16",
          "url": "https://amplitude.com/releases/automated-insights"
        },
        {
          "title": "Amplitude MCP",
          "description": "AI: Amplitude MCP",
          "date": "2025-10-21",
          "url": "https://amplitude.com/releases/amplitude-mcp"
        },
        {
          "title": "G&S Themes — Custom CSS",
          "description": "Guides and Surveys: G&S Themes — Custom CSS",
          "date": "2025-10-21",
          "url": "https://amplitude.com/releases/1761081647.104099"
        },
        {
          "title": "Web Vitals Metrics Collection",
          "description": "Analytics: Web Vitals Metrics Collection",
          "date": "2025-10-21",
          "url": "https://amplitude.com/releases/1761084164.959569"
        },
        {
          "title": "SDK remote config server url for proxy",
          "description": "Activation: SDK remote config server url for proxy",
          "date": "2025-10-23",
          "url": "https://amplitude.com/releases/1761238563.263249"
        },
        {
          "title": "Usability win: Duplicate Charts from Dashboards",
          "description": "Amplitude product update: Usability win: Duplicate Charts from Dashboards",
          "date": "2025-10-23",
          "url": "https://amplitude.com/releases/duplicate-charts-from-dashboards"
        },
        {
          "title": "TikTok, LinkedIn and X Ad sources",
          "description": "Activation: TikTok, LinkedIn and X Ad sources",
          "date": "2025-10-23",
          "url": "https://amplitude.com/releases/1761251960.121079"
        },
        {
          "title": "Currency Conversion OOTB derived properties in event streaming",
          "description": "Data: Currency Conversion OOTB derived properties in event streaming",
          "date": "2025-10-31",
          "url": "https://amplitude.com/releases/currency-conversion-ootb-derived-properties-in-event-streaming"
        },
        {
          "title": "New Popover positions",
          "description": "Analytics: New Popover positions",
          "date": "2025-10-31",
          "url": "https://amplitude.com/releases/guides-new-popover-positions"
        },
        {
          "title": "Improved Notifications for Data Warehouse Activity",
          "description": "Data: Improved Notifications for Data Warehouse Activity",
          "date": "2025-10-31",
          "url": "https://amplitude.com/releases/improved-notifications-for-data-warehouse-activity"
        },
        {
          "title": "Autocapture: Page Properties",
          "description": "Analytics: Autocapture: Page Properties",
          "date": "2025-11-03",
          "url": "https://amplitude.com/releases/autocapture-page-properties"
        },
        {
          "title": "Conditional Logic V2 (now with user properties)",
          "description": "Guides and Surveys: Conditional Logic V2 (now with user properties)",
          "date": "2025-11-10",
          "url": "https://amplitude.com/releases/conditional-logic-v2-now-with-user-properties"
        },
        {
          "title": "AI Feedback",
          "description": "AI: AI Feedback",
          "date": "2025-11-12",
          "url": "https://amplitude.com/releases/ai-feedback"
        },
        {
          "title": "Network Request and Frustration Interaction Tracking",
          "description": "Session Replay: Network Request and Frustration Interaction Tracking",
          "date": "2025-11-21",
          "url": "https://amplitude.com/releases/network-request-and-frustration-interaction-tracking"
        },
        {
          "title": "TRC General Availability",
          "description": "Amplitude product update: TRC General Availability",
          "date": "2025-11-25",
          "url": "https://amplitude.com/releases/trc-general-availability"
        }
      ]
    }
  ],
  "lastUpdated": "2026-02-09T04:16:37.908Z"
}